In [1]:
#Импорт библиотек:
import pandas as pd
import sqlite3

In [36]:
#Создание временной локальной базы данных:
conn = sqlite3.connect('northwind.db')
#Просмотр таблиц:
tables = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)
print(tables)

                    name
0             Categories
1        sqlite_sequence
2   CustomerCustomerDemo
3   CustomerDemographics
4              Customers
5              Employees
6    EmployeeTerritories
7          Order Details
8                 Orders
9               Products
10               Regions
11              Shippers
12             Suppliers
13           Territories

**#1. Выведите на экран всю информацию из таблицы с заказами.**

In [37]:
query_1 = """
SELECT  *
FROM orders;
"""
result_1 = pd.read_sql_query(query_1, conn)

In [38]:
result_1.head()

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,2016-07-04,2016-08-01,2016-07-16,3,16.75,Vins et alcools Chevalier,59 rue de l-Abbaye,Reims,Western Europe,51100,France
1,10249,TOMSP,6,2016-07-05,2016-08-16,2016-07-10,1,22.25,Toms Spezialitäten,Luisenstr. 48,Münster,Western Europe,44087,Germany
2,10250,HANAR,4,2016-07-08,2016-08-05,2016-07-12,2,25.00,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil
3,10251,VICTE,3,2016-07-08,2016-08-05,2016-07-15,1,20.25,Victuailles en stock,"2, rue du Commerce",Lyon,Western Europe,69004,France
4,10252,SUPRD,4,2016-07-09,2016-08-06,2016-07-11,2,36.25,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,Western Europe,B-6000,Belgium

**#2. Выведите на экран два поля из таблицы покупателей: название компании-заказчика и её город расположения.**

In [41]:
query_2 = """
SELECT  CompanyName,
        City
FROM customers;
"""
result_2 = pd.read_sql_query(query_2, conn)

In [42]:
result_2.head()

                          CompanyName         City
0                 Alfreds Futterkiste       Berlin
1  Ana Trujillo Emparedados y helados  México D.F.
2             Antonio Moreno Taquería  México D.F.
3                     Around the Horn       London
4                  Berglunds snabbköp        Luleå

**#3. Выведите на экран первые пять записей из таблицы с сотрудниками.**

In [44]:
query_3 = """
SELECT  *
FROM    employees
LIMIT 5;
"""
result_3 = pd.read_sql_query(query_3, conn)

In [46]:
result_3

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
0,1,Davolio,Nancy,Sales Representative,Ms.,1968-12-08,2012-05-01,507 - 20th Ave. E.Apt. 2A,Seattle,North America,98122,USA,(206) 555-9857,5467,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Education includes a BA in psychology from Col...,2.0,http://accweb/emmployees/davolio.bmp
1,2,Fuller,Andrew,"Vice President, Sales",Dr.,1972-02-19,2012-08-14,908 W. Capital Way,Tacoma,North America,98401,USA,(206) 555-9482,3457,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp
2,3,Leverling,Janet,Sales Representative,Ms.,1983-08-30,2012-04-01,722 Moss Bay Blvd.,Kirkland,North America,98033,USA,(206) 555-3412,3355,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Janet has a BS degree in chemistry from Boston...,2.0,http://accweb/emmployees/leverling.bmp
3,4,Peacock,Margaret,Sales Representative,Mrs.,1957-09-19,2013-05-03,4110 Old Redmond Rd.,Redmond,North America,98052,USA,(206) 555-8122,5176,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Margaret holds a BA in English literature from...,2.0,http://accweb/emmployees/peacock.bmp
4,5,Buchanan,Steven,Sales Manager,Mr.,1975-03-04,2013-10-17,14 Garrett Hill,London,British Isles,SW1 8JR,UK,(71) 555-4848,3453,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp

**#4. Выведите на экран первые двадцать записей из таблицы с заказами.**

In [48]:
query_4 = """
SELECT  *
FROM    orders
LIMIT 20;
"""
result_4 = pd.read_sql_query(query_4, conn)

In [51]:
result_4.head()

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,2016-07-04,2016-08-01,2016-07-16,3,16.75,Vins et alcools Chevalier,59 rue de l-Abbaye,Reims,Western Europe,51100,France
1,10249,TOMSP,6,2016-07-05,2016-08-16,2016-07-10,1,22.25,Toms Spezialitäten,Luisenstr. 48,Münster,Western Europe,44087,Germany
2,10250,HANAR,4,2016-07-08,2016-08-05,2016-07-12,2,25.00,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,South America,05454-876,Brazil
3,10251,VICTE,3,2016-07-08,2016-08-05,2016-07-15,1,20.25,Victuailles en stock,"2, rue du Commerce",Lyon,Western Europe,69004,France
4,10252,SUPRD,4,2016-07-09,2016-08-06,2016-07-11,2,36.25,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,Western Europe,B-6000,Belgium

**#5. Выведите на экран названия и адреса компаний-заказчиков, которые находятся во Франции**

In [52]:
query_5 = """
SELECT  CompanyName,
        Address
FROM    customers
WHERE Country = 'France';
"""
result_5 = pd.read_sql_query(query_5, conn)

In [53]:
result_5

                  CompanyName                       Address
0    Blondesddsl père et fils              24, place Kléber
1                    Bon app'          12, rue des Bouchers
2             Du monde entier  67, rue des Cinquante Otages
3           Folies gourmandes      184, chaussée de Tournai
4         France restauration                54, rue Royale
5        La corne d'abondance        67, avenue de l'Europe
6            La maison d'Asie         1 rue Alsace-Lorraine
7           Paris spécialités       265, boulevard Charonne
8        Spécialités du monde             25, rue Lauriston
9        Victuailles en stock            2, rue du Commerce
10  Vins et alcools Chevalier            59 rue de l'Abbaye

**#6. Выведите на экран имена и фамилии всех сотрудников из Лондона**

In [54]:
query_6 = """
SELECT  FirstName,
        LastName
FROM employees
WHERE City = 'London';
"""
result_6 = pd.read_sql_query(query_6, conn)

In [55]:
result_6

  FirstName   LastName
0    Steven   Buchanan
1   Michael     Suyama
2    Robert       King
3      Anne  Dodsworth

**#7. Выведите на экран имена и фамилии сотрудников из Лондона, чей домашний номер телефона заканчивается на 8.**

In [56]:
query_7 = """
SELECT  FirstName,
        LastName
FROM    employees
WHERE   City = 'London'
        AND HomePhone LIKE '%8';
"""
result_7 = pd.read_sql_query(query_7, conn)

In [57]:
result_7

  FirstName  LastName
0    Steven  Buchanan
1    Robert      King

**#8. Выведите на экран список уникальных названий городов доставки, начинающихся на San, в которые оформили хотя бы один заказ после 16 июля 1996 года. Отсортируйте таблицу в лексикографическом порядке по убыванию.**

In [58]:
query_8 = """
SELECT  DISTINCT ShipCity
FROM    orders
WHERE   ShipCity LIKE 'San%'
        AND OrderDate > '1996-06-16'
ORDER BY    ShipCity DESC;
"""
result_8 = pd.read_sql_query(query_8, conn)

In [59]:
result_8

        ShipCity
0  San Francisco
1  San Cristóbal

**#9. Выведите всю информацию о сотрудниках, отсортировав записи в порядке убывания их даты рождения.**

In [60]:
query_9 = """
SELECT  *
FROM    employees
ORDER BY    BirthDate DESC;
"""
result_9 = pd.read_sql_query(query_9, conn)

In [62]:
result_9.head()

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
0,9,Dodsworth,Anne,Sales Representative,Ms.,1986-01-27,2014-11-15,7 Houndstooth Rd.,London,British Isles,WG2 7LT,UK,(71) 555-4444,452,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Anne has a BA degree in English from St. Lawre...,5.0,http://accweb/emmployees/davolio.bmp
1,3,Leverling,Janet,Sales Representative,Ms.,1983-08-30,2012-04-01,722 Moss Bay Blvd.,Kirkland,North America,98033,USA,(206) 555-3412,3355,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Janet has a BS degree in chemistry from Boston...,2.0,http://accweb/emmployees/leverling.bmp
2,6,Suyama,Michael,Sales Representative,Mr.,1983-07-02,2013-10-17,Coventry House\nMiner Rd.,London,British Isles,EC2 7JR,UK,(71) 555-7773,428,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Michael is a graduate of Sussex University (MA...,5.0,http://accweb/emmployees/davolio.bmp
3,7,King,Robert,Sales Representative,Mr.,1980-05-29,2014-01-02,Edgeham Hollow\nWinchester Way,London,British Isles,RG1 9SP,UK,(71) 555-5598,465,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Robert King served in the Peace Corps and trav...,5.0,http://accweb/emmployees/davolio.bmp
4,8,Callahan,Laura,Inside Sales Coordinator,Ms.,1978-01-09,2014-03-05,4726 - 11th Ave. N.E.,Seattle,North America,98105,USA,(206) 555-1189,2344,b'\xff\xd8\xff\xe0\x00\x10JFIF\x00\x01\x02\x00...,Laura received a BA in psychology from the Uni...,2.0,http://accweb/emmployees/davolio.bmp

**#10. Выведите всю информацию из первых 100 записей таблицы заказов, отсортированных по стране доставки в лексикографическом порядке по возрастанию.**

In [63]:
query_10 = """
SELECT  *
FROM    orders
ORDER BY    ShipCountry
LIMIT 100;
"""
result_10 = pd.read_sql_query(query_10, conn)

In [66]:
result_10.head()

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10409,OCEAN,3,2017-01-09,2017-02-06,2017-01-14,1,16.00,Océano Atlántico Ltda.,Ing. Gustavo Moncada 8585 Piso 20-A,Buenos Aires,South America,1010,Argentina
1,10448,RANCH,4,2017-02-17,2017-03-17,2017-02-24,2,16.50,Rancho grande,Av. del Libertador 900,Buenos Aires,South America,1010,Argentina
2,10521,CACTU,8,2017-04-29,2017-05-27,2017-05-02,2,14.75,Cactus Comidas para llevar,Cerrito 333,Buenos Aires,South America,1010,Argentina
3,10531,OCEAN,7,2017-05-08,2017-06-05,2017-05-19,1,10.50,Océano Atlántico Ltda.,Ing. Gustavo Moncada 8585 Piso 20-A,Buenos Aires,South America,1010,Argentina
4,10716,RANCH,4,2017-10-24,2017-11-21,2017-10-27,2,15.50,Rancho grande,Av. del Libertador 900,Buenos Aires,South America,1010,Argentina

**#11. Используя таблицу с заказами, выведите количество уникальных идентификаторов клиентов (поле CustomerID), которые совершили хотя бы один заказ.**

In [67]:
query_11 = """
SELECT  COUNT(CustomerID)
FROM    customers
WHERE   CustomerID IN (
    SELECT  CustomerID
    FROM    orders
    GROUP BY    CustomerID
    HAVING COUNT(OrderID) >= 1
)
"""
result_11 = pd.read_sql_query(query_11, conn)

In [68]:
result_11

   COUNT(CustomerID)
0                 93

**#12. Для всех товаров, у которых указан поставщик, выведите пары с названием товара и названием компании-поставщика этого товара.**

In [69]:
query_12 = """
SELECT  pr.ProductName,
        sup.CompanyName
FROM    products pr
LEFT JOIN   suppliers AS sup ON pr.SupplierID=sup.SupplierID
WHERE    pr.SupplierID IS NOT NULL;
"""
result_12 = pd.read_sql_query(query_12, conn)

In [70]:
result_12

                        ProductName                        CompanyName
0                              Chai                     Exotic Liquids
1                             Chang                     Exotic Liquids
2                     Aniseed Syrup                     Exotic Liquids
3      Chef Anton's Cajun Seasoning         New Orleans Cajun Delights
4            Chef Anton's Gumbo Mix         New Orleans Cajun Delights
..                              ...                                ...
72                       Röd Kaviar                  Svensk Sjöföda AB
73                    Longlife Tofu                      Tokyo Traders
74             Rhönbräu Klosterbier  Plutzer Lebensmittelgroßmärkte AG
75                     Lakkalikööri                          Karkki Oy
76  Original Frankfurter grüne Soße  Plutzer Lebensmittelgroßmärkte AG

[77 rows x 2 columns]

**#13. Выведите среднюю цену товаров каждой категории из таблицы products. Округлите среднее до двух знаков после запятой.**

In [75]:
query_13 = """
SELECT  CategoryID category,
        ROUND(AVG(CAST(UnitPrice AS numeric)), 2) avg_price
FROM    products
GROUP BY    CategoryID
"""
result_13 = pd.read_sql_query(query_13, conn)

In [76]:
result_13

   category  avg_price
0         1      37.98
1         2      23.06
2         3      25.16
3         4      28.73
4         5      20.25
5         6      54.01
6         7      32.37
7         8      20.68

**#14. Выведите уникальные названия всех стран, в которые было отправлено более 10 заказов. Отсортируйте вывод по названию страны в лексикографическом порядке по убыванию.**

In [77]:
query_14 = """
SELECT  DISTINCT ShipCountry
FROM    orders
GROUP BY ShipCountry
HAVING COUNT(OrderID) > 10
ORDER BY ShipCountry DESC;
"""
result_14 = pd.read_sql_query(query_14, conn)

In [79]:
result_14.head()

   ShipCountry
0    Venezuela
1          USA
2           UK
3  Switzerland
4       Sweden

**#15. Отберите страны, в которых оформили больше 30 заказов, и выведите количество заказов в этих странах. Результаты отсортируйте по названию страны в лексикографическом порядке.**

In [81]:
query_15 = """
SELECT  ShipCountry,
        COUNT(OrderID)
FROM orders
GROUP BY    ShipCountry
HAVING  COUNT(OrderID) > 30
ORDER BY    ShipCountry;
"""
result_15 = pd.read_sql_query(query_15, conn)

In [83]:
result_15.head()

  ShipCountry  COUNT(OrderID)
0   Argentina             535
1     Austria             380
2     Belgium             338
3      Brazil            1683
4      Canada             547

**#16. Выведите на экран названия товаров с ценой выше среднего среди всех представленных позиций в таблице.**

In [85]:
query_16 = """
SELECT  ProductName
FROM    products
WHERE   UnitPrice > (
    SELECT  AVG(UnitPrice)
    FROM    products
);
"""
result_16 = pd.read_sql_query(query_16, conn)

In [87]:
result_16.head()

                       ProductName
0  Uncle Bob's Organic Dried Pears
1       Northwoods Cranberry Sauce
2                  Mishi Kobe Niku
3                            Ikura
4        Queso Manchego La Pastora

**#17. Выведите названия товаров с ценой ниже средней среди всех представленных товаров или равной ей.**

In [88]:
query_17 = """
SELECT  ProductName
FROM    products
WHERE   UnitPrice <= (
    SELECT  AVG(UnitPrice)
    FROM    products
);
"""
result_17 = pd.read_sql_query(query_17, conn)

In [90]:
result_17.head()

                    ProductName
0                          Chai
1                         Chang
2                 Aniseed Syrup
3  Chef Anton's Cajun Seasoning
4        Chef Anton's Gumbo Mix

**#18. Выведите на экран идентификаторы заказов и для каждого из них — его суммарную стоимость с учётом всех товаров, включённых в заказ, и их количества, но без учёта скидки. Не округляйте получившиеся значения.**

In [102]:
query_18 = """
SELECT  OrderID,
        SUM(UnitPrice * Quantity) order_total
FROM    "Order Details"
GROUP BY OrderID;
"""
result_18 = pd.read_sql_query(query_18, conn)

In [104]:
result_18.head()

   OrderID  order_total
0    10248        440.0
1    10249       1863.4
2    10250       1813.0
3    10251        670.8
4    10252       3730.0

**#19. Выведите на экран идентификаторы заказов и для каждого из них — суммарную стоимость заказа с учётом всех заказанных товаров и их количества с учётом скидки. Получившиеся значения округлите до ближайшего целого числа. Отсортируйте выдачу по возрастанию идентификаторов заказов.**

In [105]:
query_19 = """
SELECT  OrderID,
        ROUND(SUM(UnitPrice * Quantity * (1 - Discount))) order_total_with_discount
FROM    "Order Details"
GROUP BY OrderID
ORDER BY OrderID;
"""
result_19 = pd.read_sql_query(query_19, conn)

In [107]:
result_19.head()

   OrderID  order_total_with_discount
0    10248                      440.0
1    10249                     1863.0
2    10250                     1553.0
3    10251                      654.0
4    10252                     3598.0

**#20. Выведите информацию о каждом товаре:**\
**- его идентификатор из таблицы с товарами;**\
**- его название из таблицы с товарами;**\
**- название его категории из таблицы категорий;**\
**- описание его категории из таблицы категорий.**\
**Таблицу отсортируйте по возрастанию идентификаторов товаров.**

In [108]:
query_20 = """
SELECT  pr.ProductID,
        pr.ProductName,
        cat.CategoryName,
        cat.Description
FROM    products pr
LEFT JOIN   categories AS cat ON pr.CategoryID=cat.CategoryID
ORDER BY    pr.ProductID;
"""
result_20 = pd.read_sql_query(query_20, conn)

In [110]:
result_20.head()

,ProductID,ProductName,CategoryName,Description
0,1,Chai,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Chang,Beverages,"Soft drinks, coffees, teas, beers, and ales"
2,3,Aniseed Syrup,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
3,4,Chef Anton's Cajun Seasoning,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
4,5,Chef Anton's Gumbo Mix,Condiments,"Sweet and savory sauces, relishes, spreads, an..."

**#21. Для каждого месяца каждого года посчитайте уникальных пользователей, оформивших хотя бы один заказ в этот месяц.**

In [126]:
query_21 = """
SELECT  DATE(OrderDate, 'start of month') month,
        COUNT(DISTINCT CustomerID) unique_users
FROM    orders
GROUP BY    DATE(OrderDate, 'start of month');
"""
result_21 = pd.read_sql_query(query_21, conn)

In [127]:
result_21

          month  unique_users
0    2012-07-01            49
1    2012-08-01            70
2    2012-09-01            72
3    2012-10-01            66
4    2012-11-01            65
..          ...           ...
131  2023-06-01            59
132  2023-07-01            67
133  2023-08-01            60
134  2023-09-01            66
135  2023-10-01            58

[136 rows x 2 columns]

**#22. Для каждого года из таблицы заказов посчитайте суммарную выручку с продаж за этот год. Используйте детальную информацию о заказах. Не забудьте учесть скидку (поле Discount) на товар. Результаты отсортируйте по убыванию значения выручки.**

In [130]:
query_22 = """
SELECT  strftime('%Y', OrderDate) year,
        SUM(UnitPrice * Quantity * (1 - Discount)) total_revenue
FROM    Orders ord
LEFT JOIN   "Order Details" AS det ON ord.OrderID=det.OrderID
GROUP BY    strftime('%Y', OrderDate)
ORDER BY    total_revenue DESC;
"""
result_22 = pd.read_sql_query(query_22, conn)

In [131]:
result_22

    year  total_revenue
0   2015   4.142346e+07
1   2021   4.135555e+07
2   2016   4.056867e+07
3   2017   4.020990e+07
4   2022   3.974207e+07
5   2014   3.887015e+07
6   2020   3.886244e+07
7   2013   3.863312e+07
8   2019   3.851696e+07
9   2018   3.832662e+07
10  2023   3.305449e+07
11  2012   1.882320e+07

**#23. Выведите названия компаний-покупателей, которые совершили не менее двух заказов в 2016 году. Отсортируйте вывод по полю с названиями компаний в лексикографическом порядке по возрастанию.**

In [174]:
query_23 = """
SELECT  DISTINCT c.CompanyName
FROM    Orders o
LEFT JOIN   Customers AS c ON o.CustomerID=c.CustomerID
WHERE   o.CustomerID IN (
    SELECT  CustomerID
    FROM    Orders
    WHERE strftime('%Y', OrderDate) = '2016'
    GROUP BY    CustomerID
    HAVING  COUNT(OrderID) >= 2
)
ORDER BY    c.CompanyName;
"""
result_23 = pd.read_sql_query(query_23, conn)

In [175]:
result_23

                           CompanyName
0                  Alfreds Futterkiste
1   Ana Trujillo Emparedados y helados
2              Antonio Moreno Taquería
3                      Around the Horn
4                        B's Beverages
..                                 ...
87                      Wartian Herkku
88              Wellington Importadora
89                White Clover Markets
90                         Wilman Kala
91                      Wolski  Zajazd

[92 rows x 1 columns]

**#24. Выведите названия компаний-покупателей, которые совершили более пяти заказов в 2017 году. Отсортируйте вывод по полю с названиями компаний в лексикографическом порядке по убыванию.**

In [177]:
query_24 = """
SELECT  DISTINCT c.CompanyName
FROM    orders o
LEFT JOIN   customers AS c ON o.CustomerID=c.CustomerID
WHERE   o.CustomerID IN (
    SELECT  CustomerID
    FROM    orders
    WHERE   strftime('%Y', OrderDate) = '2017'
    GROUP BY    CustomerID
    HAVING  COUNT(OrderID) > 5
)
ORDER BY    c.CompanyName DESC;
"""
result_24 = pd.read_sql_query(query_24, conn)

In [178]:
result_24

                           CompanyName
0                       Wolski  Zajazd
1                          Wilman Kala
2                 White Clover Markets
3               Wellington Importadora
4                       Wartian Herkku
..                                 ...
87                       B's Beverages
88                     Around the Horn
89             Antonio Moreno Taquería
90  Ana Trujillo Emparedados y helados
91                 Alfreds Futterkiste

[92 rows x 1 columns]

**#25. Выведите среднее количество заказов компаний-покупателей за период с 1 января по 1 июля 2018 года. Округлите среднее до ближайшего целого числа. В расчётах учитывайте только те компании, которые совершили более семи покупок за всё время, а не только за указанный период.**

In [181]:
query_25 = """
SELECT  ROUND(AVG(order_count)) avg_orders
FROM    (
    SELECT  CustomerID,
            COUNT(OrderID) order_count
    FROM    orders
    WHERE   OrderDate BETWEEN '2018-01-01' AND '2018-06-01'
    GROUP BY    CustomerID
) AS c
WHERE   c.CustomerID IN (
    SELECT  CustomerID
    FROM    orders
    GROUP BY    CustomerID
    HAVING  COUNT(OrderID) > 7
);
"""
result_25 = pd.read_sql_query(query_25, conn)

In [182]:
result_25

   avg_orders
0         9.0

**#26. Выведите на экран названия компаний-покупателей, которые хотя бы раз оформили более одного заказа в день. Для подсчёта заказов используйте поле OrderDate. Отсортируйте названия компаний в лексикографическом порядке по возрастанию.**

In [186]:
query_26 = """
SELECT  DISTINCT c.CompanyName
FROM    orders o
LEFT JOIN   customers AS c ON o.CustomerID=c.CustomerID
WHERE o.CustomerID IN (
    SELECT  CustomerID
    FROM    orders
    GROUP BY    OrderDate, CustomerID
    HAVING  COUNT(OrderID) > 1
)
ORDER BY c.CompanyName;
"""
result_26 = pd.read_sql_query(query_26, conn)

In [187]:
result_26

               CompanyName
0    Bottom-Dollar Markets
1  Great Lakes Food Market
2          Königlich Essen
3         LINO-Delicateses
4     La corne d'abondance
5       Save-a-lot Markets

**#27. Выведите города, в которые отправляли заказы не менее 10 раз. Названия городов отсортируйте в лексикографическом порядке по убыванию.**

In [188]:
query_27 = """
SELECT  DISTINCT ShipCity
FROM    orders
WHERE   ShipCity IN (
    SELECT ShipCity
    FROM orders
    GROUP BY ShipCity
    HAVING COUNT(OrderID) >= 10
)
ORDER BY    ShipCity DESC;
"""
result_27 = pd.read_sql_query(query_27, conn)

In [189]:
result_27

        ShipCity
0          Århus
1       Warszawa
2    Walla Walla
3     Versailles
4      Vancouver
..           ...
65  Barquisimeto
66     Barcelona
67     Anchorage
68   Albuquerque
69        Aachen

[70 rows x 1 columns]

**#28. Выведите города, в которые отправляли заказы не более 160 раз. Названия городов отсортируйте в лексикографическом порядке по возрастанию.**

In [212]:
query_28 = """
SELECT  DISTINCT ShipCity
FROM    orders
WHERE   ShipCity IN (
    SELECT  ShipCity
    FROM    orders
    GROUP BY    ShipCity
    HAVING COUNT(OrderID) <= 160
)
ORDER BY ShipCity;
"""
result_28= pd.read_sql_query(query_28, conn)

In [213]:
result_28

          ShipCity
0        Barcelona
1  I. de Margarita
2            Lille
3            Århus

**#29. На сколько процентов ежемесячно менялось количество заказов в компании Northwind с 1 апреля по 1 декабря 2017 года? Отобразите таблицу со следующими полями:**\
**- номер месяца;**\
**- количество заказов в месяц;**\
**- процент, который показывает, насколько изменилось количество заказов в текущем месяце по сравнению с предыдущим.**\
**Если заказов стало меньше, значение процента должно быть отрицательным, если больше — положительным. Округлите значение процента до двух знаков после запятой. Отсортируйте таблицу по возрастанию значения месяца.**

In [289]:
query_29 = """
WITH
pre_month AS (
    SELECT  CAST(strftime('%m', OrderDate) + 1 AS int) month_number,
            CAST(COUNT(OrderID) AS REAL) orders_by_pre_month
    FROM    Orders
    WHERE   CAST(strftime('%Y', OrderDate) AS int) = 2017
    GROUP BY CAST(strftime('%m', OrderDate) AS int)
),
current_mounth AS (
    SELECT  CAST(strftime('%m', OrderDate) AS int) month_number,
             CAST(COUNT(OrderID) AS REAL) orders_by_month
    FROM    Orders
    WHERE   CAST(strftime('%Y', OrderDate) AS int) = 2017
    GROUP BY CAST(strftime('%m', OrderDate) AS int)
)


SELECT  cur.month_number,
        cur.orders_by_month,
        ROUND((orders_by_month - pre.orders_by_pre_month) / pre.orders_by_pre_month * 100, 2) percentage
FROM    current_mounth cur
INNER JOIN   pre_month AS pre ON cur.month_number=pre.month_number
WHERE cur.month_number BETWEEN 4 AND 12
ORDER BY cur.month_number;
"""
result_29 = pd.read_sql_query(query_29, conn)

In [290]:
result_29

   month_number  orders_by_month  percentage
0             4            142.0      -12.88
1             5            172.0       21.13
2             6            134.0      -22.09
3             7            136.0        1.49
4             8            142.0        4.41
5             9            139.0       -2.11
6            10            162.0       16.55
7            11            155.0       -4.32
8            12            159.0        2.58

**#30. На сколько процентов ежегодно менялось количество заказов в Northwind с 2016 по 2018 годы. Отобразите таблицу со следующими полями:**\
**- Число года.**\
**- Количество заказов за год.**\
**- Процент, округлённый до целого числа, который показывает, насколько изменилось количество заказов в текущем году по сравнению с предыдущим.**\
**Для 2016 года выведите значение NULL.**

In [297]:
query_30 = """
WITH
pre_year AS (
    SELECT  CAST(strftime('%Y', OrderDate) + 1 AS int) year_number,
            CAST(COUNT(OrderID) AS REAL) orders_by_pre_year
    FROM    orders
    WHERE   CAST(strftime('%Y', OrderDate) AS int) BETWEEN 2016 AND 2018
    GROUP BY CAST(strftime('%Y', OrderDate) AS int)
),
current_year AS (
    SELECT  CAST(strftime('%Y', OrderDate) AS int) year_number,
            CAST(COUNT(OrderID) AS REAL) orders_by_year
    FROM    orders
    WHERE   CAST(strftime('%Y', OrderDate) AS int) BETWEEN 2016 AND 2018
    GROUP BY CAST(strftime('%Y', OrderDate) AS int)
)


SELECT  cur.year_number,
        orders_by_year,
        ROUND((orders_by_year - pre.orders_by_pre_year) / pre.orders_by_pre_year * 100, 2) percentage
FROM    current_year cur
FULL OUTER JOIN   pre_year AS pre ON cur.year_number=pre.year_number
WHERE cur.year_number BETWEEN 2016 AND 2018
ORDER BY cur.year_number;
"""
result_30 = pd.read_sql_query(query_30, conn)

In [298]:
result_30

   year_number  orders_by_year  percentage
0         2016          1506.0         NaN
1         2017          1780.0       18.19
2         2018          1549.0      -12.98

**#31. Рассчитайте аналог Retention Rate по неделям для компаний-заказчиков. Объедините компании в когорты по неделе их первого заказа (поле OrderDate). Возвращение определяйте по наличию заказа в течение текущей недели. Значение Retention Rate округлите до двух знаков после запятой.**

In [318]:
query_31 = """
WITH
-- Определяем дату первого заказа (день рождения когорты) для каждого клиента:
cohorts AS (
    SELECT 
        CustomerID,
        date(MIN(OrderDate), 'weekday 1', '-7 days') AS cohort_week
    FROM orders
    GROUP BY CustomerID
),
-- Группируем все заказы по неделям:
activities AS (
    SELECT 
        CustomerID,
        date(OrderDate, 'weekday 1', '-7 days') AS order_week
    FROM orders
    GROUP BY CustomerID, order_week
),
-- Считаем количество клиентов в каждой когорте:
cohort_sizes AS (
    SELECT 
        cohort_week,
        COUNT(CustomerID) AS cohort_size
    FROM cohorts
    GROUP BY cohort_week
),
-- Соединяем данные, чтобы увидеть активность клиентов по неделям относительно их первой покупки:
retention_table AS (
    SELECT 
        c.cohort_week,
        a.order_week,
        COUNT(DISTINCT a.CustomerID) AS active_customers
    FROM cohorts c
    JOIN activities a ON c.CustomerID = a.CustomerID
    GROUP BY c.cohort_week, a.order_week
)

-- Финальный расчет Retention Rate:
SELECT 
    r.cohort_week,
    r.order_week,
    r.active_customers,
    s.cohort_size,
    ROUND(CAST(r.active_customers AS REAL) / s.cohort_size * 100, 2) AS retention_rate
FROM retention_table r
JOIN cohort_sizes s ON r.cohort_week = s.cohort_week
ORDER BY r.cohort_week, r.order_week;
"""
result_31 = pd.read_sql_query(query_31, conn)

In [319]:
result_31

     cohort_week  order_week  active_customers  cohort_size  retention_rate
0     2012-07-09  2012-07-09                22           22          100.00
1     2012-07-09  2012-07-16                 4           22           18.18
2     2012-07-09  2012-07-23                 3           22           13.64
3     2012-07-09  2012-07-30                 3           22           13.64
4     2012-07-09  2012-08-06                 4           22           18.18
...          ...         ...               ...          ...             ...
5557  2012-10-29  2023-01-30                 1            1          100.00
5558  2012-10-29  2023-05-08                 1            1          100.00
5559  2012-10-29  2023-05-15                 1            1          100.00
5560  2012-10-29  2023-09-04                 1            1          100.00
5561  2012-10-29  2023-09-11                 1            1          100.00

[5562 rows x 5 columns]

**#32. Рассчитайте аналог Retention Rate по месяцам для компаний-заказчиков. Объедините компании в когорты по месяцу их первого заказа (поле OrderDate). Возвращение определяйте по наличию заказа в текущем месяце. Значение Retention Rate округлите до двух знаков после запятой.**

In [321]:
query_32 = """
WITH
-- Определяем дату первого заказа (день рождения когорты) для каждого клиента:
cohorts AS (
    SELECT 
        CustomerID,
        date(MIN(OrderDate), 'start of month') AS cohort_month
    FROM orders
    GROUP BY CustomerID
),
-- Группируем все заказы по месяцам:
activities AS (
    SELECT 
        CustomerID,
        date(OrderDate, 'start of month') AS order_month
    FROM orders
    GROUP BY CustomerID, order_month
),
-- Считаем количество клиентов в каждой когорте:
cohort_sizes AS (
    SELECT 
        cohort_month,
        COUNT(CustomerID) AS cohort_size
    FROM cohorts
    GROUP BY cohort_month
),
-- Соединяем данные, чтобы увидеть активность клиентов по месяцам относительно их первой покупки:
retention_table AS (
    SELECT 
        c.cohort_month,
        a.order_month,
        COUNT(DISTINCT a.CustomerID) AS active_customers
    FROM cohorts c
    JOIN activities a ON c.CustomerID = a.CustomerID
    GROUP BY c.cohort_month, a.order_month
)

-- Финальный расчет Retention Rate:
SELECT 
    r.cohort_month,
    r.order_month,
    r.active_customers,
    s.cohort_size,
    ROUND(CAST(r.active_customers AS REAL) / s.cohort_size * 100, 2) AS retention_rate
FROM retention_table r
JOIN cohort_sizes s ON r.cohort_month = s.cohort_month
ORDER BY r.cohort_month, r.order_month;
"""
result_32 = pd.read_sql_query(query_32, conn)

In [322]:
result_32

    cohort_month order_month  active_customers  cohort_size  retention_rate
0     2012-07-01  2012-07-01                49           49          100.00
1     2012-07-01  2012-08-01                39           49           79.59
2     2012-07-01  2012-09-01                37           49           75.51
3     2012-07-01  2012-10-01                36           49           73.47
4     2012-07-01  2012-11-01                32           49           65.31
..           ...         ...               ...          ...             ...
586   2012-11-01  2022-10-01                 1            1          100.00
587   2012-11-01  2023-01-01                 1            1          100.00
588   2012-11-01  2023-02-01                 1            1          100.00
589   2012-11-01  2023-05-01                 1            1          100.00
590   2012-11-01  2023-09-01                 1            1          100.00

[591 rows x 5 columns]

**#33. Рассчитайте аналог Retention Rate по годам для компаний-покупателей Northwind. Объедините пользователей в когорты по году их первого заказа (поле order_date). Возвращение определяйте по наличию заказа в текущем году. Значение Retention Rate округлите до двух знаков после запятой.**

In [323]:
query_33 = """
WITH
-- Определяем дату первого заказа (день рождения когорты) для каждого клиента:
cohorts AS (
    SELECT 
        CustomerID,
        date(MIN(OrderDate), 'start of year') AS cohort_year
    FROM orders
    GROUP BY CustomerID
),
-- Группируем все заказы по годам:
activities AS (
    SELECT 
        CustomerID,
        date(OrderDate, 'start of year') AS order_year
    FROM orders
    GROUP BY CustomerID, order_year
),
-- Считаем количество клиентов в каждой когорте:
cohort_sizes AS (
    SELECT 
        cohort_year,
        COUNT(CustomerID) AS cohort_size
    FROM cohorts
    GROUP BY cohort_year
),
-- Соединяем данные, чтобы увидеть активность клиентов по годам относительно их первой покупки:
retention_table AS (
    SELECT 
        c.cohort_year,
        a.order_year,
        COUNT(DISTINCT a.CustomerID) AS active_customers
    FROM cohorts c
    JOIN activities a ON c.CustomerID = a.CustomerID
    GROUP BY c.cohort_year, a.order_year
)

-- Финальный расчет Retention Rate:
SELECT 
    r.cohort_year,
    r.order_year,
    r.active_customers,
    s.cohort_size,
    ROUND(CAST(r.active_customers AS REAL) / s.cohort_size * 100, 2) AS retention_rate
FROM retention_table r
JOIN cohort_sizes s ON r.cohort_year = s.cohort_year
ORDER BY r.cohort_year, r.order_year;
"""
result_33 = pd.read_sql_query(query_33, conn)

In [324]:
result_33

   cohort_year  order_year  active_customers  cohort_size  retention_rate
0   2012-01-01  2012-01-01                93           93           100.0
1   2012-01-01  2013-01-01                93           93           100.0
2   2012-01-01  2014-01-01                93           93           100.0
3   2012-01-01  2015-01-01                93           93           100.0
4   2012-01-01  2016-01-01                93           93           100.0
5   2012-01-01  2017-01-01                93           93           100.0
6   2012-01-01  2018-01-01                93           93           100.0
7   2012-01-01  2019-01-01                93           93           100.0
8   2012-01-01  2020-01-01                93           93           100.0
9   2012-01-01  2021-01-01                93           93           100.0
10  2012-01-01  2022-01-01                93           93           100.0
11  2012-01-01  2023-01-01                93           93           100.0

**#34. Для каждой компании, которая оформила хотя бы два заказа, выведите:**\
**- дату оформления второго заказа (поле OrderDate), округлённую до месяца**\
**- идентификатор компании, оформившей заказ (поле CustomerID)**\
**Строки отсортируйте по значению в поле с идентификаторами в лексикографическом порядке по убыванию.**

In [331]:
query_34 = """
WITH RankedOrders AS (
    SELECT 
        CustomerID,
        OrderDate,
        -- Нумеруем заказы для каждого клиента по дате оформления
        ROW_NUMBER() OVER (PARTITION BY CustomerID ORDER BY OrderDate, OrderID) as rn
    FROM orders
)


SELECT 
    -- Округляем дату до первого числа месяца
    date(OrderDate, 'start of month') order_date,
    CustomerID
FROM RankedOrders
WHERE rn = 2
ORDER BY CustomerID DESC;
"""
result_34 = pd.read_sql_query(query_34, conn)

In [332]:
result_34

    order_date CustomerID
0   2012-08-01      WOLZA
1   2012-10-01      WILMK
2   2012-08-01      WHITC
3   2012-10-01      WELLI
4   2012-09-01      WARTH
..         ...        ...
88  2012-08-01      BERGS
89  2012-07-01      AROUT
90  2012-08-01      ANTON
91  2012-09-01      ANATR
92  2012-08-01      ALFKI

[93 rows x 2 columns]

**#35. Для каждого месяца с июля 2016 года по май 2018 года посчитайте конверсию в процентах. Найдите количество уникальных компаний-заказчиков в текущем месяце. Разделите его на общее количество компаний-заказчиков Northwind, которые оформили хотя бы один заказ за всё предыдущее время, включая текущий месяц. Под уникальностью компании в этой задаче подразумевается отсутствие повторов в выборке.**
**В итоговой таблице должны быть следующие поля:**\
**- дата первого числа текущего месяца;**\
**- количество компаний-заказчиков в текущий месяц;**\
**- общее количество компаний-заказчиков за всё предыдущее время, включая текущий месяц;**\
**- отношение количества покупателей за текущий месяц к общему количеству покупателей.**\
**При делении не забудьте привести значения к вещественному типу real, тогда после деления вы получите вещественное, а не целое число. Не забудьте умножить результат на 100 и округлить значение до двух знаков после запятой.**

In [336]:
query_35 = """
-- Считаем количество уникальных клиентов для каждого месяца:
WITH MonthlyStats AS (
    SELECT 
        date(OrderDate, 'start of month') month_date,
        COUNT(DISTINCT CustomerID) monthly_customers
    FROM orders
    WHERE OrderDate BETWEEN '2016-07-01' AND '2018-05-31'
    GROUP BY 1
),
-- Считаем количество клиентов, сделавших хотя бы один заказ до текущего месяца включительно:
CumulativeStats AS (
    SELECT 
        month_date,
        monthly_customers,
        (SELECT COUNT(DISTINCT CustomerID) 
         FROM orders o
         WHERE  date(OrderDate, 'start of month') <= m.month_date) AS total_customers
    FROM MonthlyStats m
)
-- Вычисляем конверсию с приведением типов и округлением:
SELECT 
    month_date,
    monthly_customers,
    total_customers,
    ROUND(
        CAST(monthly_customers AS REAL) / total_customers * 100, 
        2
    ) AS conversion_rate
FROM CumulativeStats
ORDER BY month_date;
"""
result_35 = pd.read_sql_query(query_35, conn)

In [337]:
result_35

    month_date  monthly_customers  total_customers  conversion_rate
0   2016-07-01                 73               93            78.49
1   2016-08-01                 73               93            78.49
2   2016-09-01                 66               93            70.97
3   2016-10-01                 74               93            79.57
4   2016-11-01                 72               93            77.42
5   2016-12-01                 69               93            74.19
6   2017-01-01                 76               93            81.72
7   2017-02-01                 68               93            73.12
8   2017-03-01                 75               93            80.65
9   2017-04-01                 75               93            80.65
10  2017-05-01                 78               93            83.87
11  2017-06-01                 72               93            77.42
12  2017-07-01                 74               93            79.57
13  2017-08-01                 77               93            82.80
14  2017-09-01                 69               93            74.19
15  2017-10-01                 75               93            80.65
16  2017-11-01                 77               93            82.80
17  2017-12-01                 74               93            79.57
18  2018-01-01                 80               93            86.02
19  2018-02-01                 73               93            78.49
20  2018-03-01                 79               93            84.95
21  2018-04-01                 76               93            81.72
22  2018-05-01                 63               93            67.74